//1) створити функцію яка приймає масив та виводить його
//
//let arr = [1, 65, 'Max', true, 345];
//
//function arrFunction(user = 'NO') {
//    document.write(user);
//    document.write('<br>')
//}
//
//arrFunction(arr);
//arrFunction();
//
//2) створити функцію яка заповнює масив рандомними числами та виводить його. Для виведення використати попередню функцію.
//
//let arr = [1, 65, 'Max', true, 345];
//
//const newArr = [11, 22, 33, 44, 55]
//
//function arrFunction(user = 'NO') {
//    for (let arr1 of newArr) {
//        arr.push(arr1)
//    }
//}
//
//arrFunction(arr);
//
//3) створити функцію яка приймає три числа та виводить найменьше. (Без Math.min!)

function lessNum() {
    
}

//4) створити функцію яка приймає три числа та виводить найбільше. (Без Math.max!)



//5) створити функцію яка повертає найбільше число з масиву



//6) створити функцію яка повертає найменьше число з масиву



//7) створити функцію яка приймає масив чисел, сумує значення елементів масиву та повертає його.



//8) створити функцію яка приймає масив чисел та повертає середнє арифметичне його значень.



//9) Створити функцію яка приймає масив будь яких объектів, та повертає масив ключів всіх обєктів
//EXAMPLE:
//    [{name: 'Dima', age: 13}, {model: 'Camry'}]  ===> [ name, age, model ]



//10) Створити функцію яка приймає масив будь яких объектів, та повертає масив значень всіх обєктів
//EXAMPLE:
//    [{name: 'Dima', age: 13}, {model: 'Camry'}]  ===> [ Dima, 13, Camry ]



//11) створити функцію  яка скаладає значення елементів з однаковими індексами  та повертає новий результуючий масив.
//    EXAMPLE:
//[1,2,3,4]
//    [2,3,4,5]
//результат
//    [3,5,7,9]












